Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOptionWarn Property
 A pad in a Design Option cannot be hosted by a topography in another Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingPadByElementsInAnotherDesignOptionWarn { get; }
Public Shared ReadOnly Property ConfusingPadByElementsInAnotherDesignOptionWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingPadByElementsInAnotherDesignOptionWarn {
	FailureDefinitionId^ get ();
}
static member ConfusingPadByElementsInAnotherDesignOptionWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace